GopalSaraf/Practicals/PSDL/include/proc/pic16f1614.inc
// Register: AT1CC3H
#define AT1CC3H AT1CC3H
AT1CC3H                                  equ 0898h
// bitfield definitions
AT1CC3H_AT1CC38_POSN                     equ 0000h
AT1CC3H_AT1CC38_POSITION                 equ 0000h
AT1CC3H_AT1CC38_SIZE                     equ 0001h
AT1CC3H_AT1CC38_LENGTH                   equ 0001h
AT1CC3H_AT1CC38_MASK                     equ 0001h
AT1CC3H_AT1CC39_POSN                     equ 0001h
AT1CC3H_AT1CC39_POSITION                 equ 0001h
AT1CC3H_AT1CC39_SIZE                     equ 0001h
AT1CC3H_AT1CC39_LENGTH                   equ 0001h
AT1CC3H_AT1CC39_MASK                     equ 0002h
AT1CC3H_CC38_POSN                        equ 0000h
AT1CC3H_CC38_POSITION                    equ 0000h
AT1CC3H_CC38_SIZE                        equ 0001h
AT1CC3H_CC38_LENGTH                      equ 0001h
AT1CC3H_CC38_MASK                        equ 0001h
AT1CC3H_CC39_POSN                        equ 0001h
AT1CC3H_CC39_POSITION                    equ 0001h
AT1CC3H_CC39_SIZE                        equ 0001h
AT1CC3H_CC39_LENGTH                      equ 0001h
AT1CC3H_CC39_MASK                        equ 0002h

// Register: AT1CCON3
#define AT1CCON3 AT1CCON3
AT1CCON3                                 equ 0899h
// bitfield definitions
AT1CCON3_AT1CC3MODE_POSN                 equ 0000h
AT1CCON3_AT1CC3MODE_POSITION             equ 0000h
AT1CCON3_AT1CC3MODE_SIZE                 equ 0001h
AT1CCON3_AT1CC3MODE_LENGTH               equ 0001h
AT1CCON3_AT1CC3MODE_MASK                 equ 0001h
AT1CCON3_AT1CAP3P_POSN                   equ 0003h
AT1CCON3_AT1CAP3P_POSITION               equ 0003h
AT1CCON3_AT1CAP3P_SIZE                   equ 0001h
AT1CCON3_AT1CAP3P_LENGTH                 equ 0001h
AT1CCON3_AT1CAP3P_MASK                   equ 0008h
AT1CCON3_AT1CC3POL_POSN                  equ 0004h
AT1CCON3_AT1CC3POL_POSITION              equ 0004h
AT1CCON3_AT1CC3POL_SIZE                  equ 0001h
AT1CCON3_AT1CC3POL_LENGTH                equ 0001h
AT1CCON3_AT1CC3POL_MASK                  equ 0010h
AT1CCON3_AT1CC3EN_POSN                   equ 0007h
AT1CCON3_AT1CC3EN_POSITION               equ 0007h
AT1CCON3_AT1CC3EN_SIZE                   equ 0001h
AT1CCON3_AT1CC3EN_LENGTH                 equ 0001h
AT1CCON3_AT1CC3EN_MASK                   equ 0080h
AT1CCON3_CC3MODE_POSN                    equ 0000h
AT1CCON3_CC3MODE_POSITION                equ 0000h
AT1CCON3_CC3MODE_SIZE                    equ 0001h
AT1CCON3_CC3MODE_LENGTH                  equ 0001h
AT1CCON3_CC3MODE_MASK                    equ 0001h
AT1CCON3_CAP3P_POSN                      equ 0003h
AT1CCON3_CAP3P_POSITION                  equ 0003h
AT1CCON3_CAP3P_SIZE                      equ 0001h
AT1CCON3_CAP3P_LENGTH                    equ 0001h
AT1CCON3_CAP3P_MASK                      equ 0008h
AT1CCON3_CC3POL_POSN                     equ 0004h
AT1CCON3_CC3POL_POSITION                 equ 0004h
AT1CCON3_CC3POL_SIZE                     equ 0001h
AT1CCON3_CC3POL_LENGTH                   equ 0001h
AT1CCON3_CC3POL_MASK                     equ 0010h
AT1CCON3_CC3EN_POSN                      equ 0007h
AT1CCON3_CC3EN_POSITION                  equ 0007h
AT1CCON3_CC3EN_SIZE                      equ 0001h
AT1CCON3_CC3EN_LENGTH                    equ 0001h
AT1CCON3_CC3EN_MASK                      equ 0080h

// Register: SMT1TMRL
#define SMT1TMRL SMT1TMRL
SMT1TMRL                                 equ 0D8Ch
// bitfield definitions
SMT1TMRL_SMT1TMR_POSN                    equ 0000h
SMT1TMRL_SMT1TMR_POSITION                equ 0000h
SMT1TMRL_SMT1TMR_SIZE                    equ 0008h
SMT1TMRL_SMT1TMR_LENGTH                  equ 0008h
SMT1TMRL_SMT1TMR_MASK                    equ 00FFh
SMT1TMRL_SMT1TMR0_POSN                   equ 0000h
SMT1TMRL_SMT1TMR0_POSITION               equ 0000h
SMT1TMRL_SMT1TMR0_SIZE                   equ 0001h
SMT1TMRL_SMT1TMR0_LENGTH                 equ 0001h
SMT1TMRL_SMT1TMR0_MASK                   equ 0001h
SMT1TMRL_SMT1TMR1_POSN                   equ 0001h
SMT1TMRL_SMT1TMR1_POSITION               equ 0001h
SMT1TMRL_SMT1TMR1_SIZE                   equ 0001h
SMT1TMRL_SMT1TMR1_LENGTH                 equ 0001h
SMT1TMRL_SMT1TMR1_MASK                   equ 0002h
SMT1TMRL_SMT1TMR2_POSN                   equ 0002h
SMT1TMRL_SMT1TMR2_POSITION               equ 0002h
SMT1TMRL_SMT1TMR2_SIZE                   equ 0001h
SMT1TMRL_SMT1TMR2_LENGTH                 equ 0001h
SMT1TMRL_SMT1TMR2_MASK                   equ 0004h
SMT1TMRL_SMT1TMR3_POSN                   equ 0003h
SMT1TMRL_SMT1TMR3_POSITION               equ 0003h
SMT1TMRL_SMT1TMR3_SIZE                   equ 0001h
SMT1TMRL_SMT1TMR3_LENGTH                 equ 0001h
SMT1TMRL_SMT1TMR3_MASK                   equ 0008h
SMT1TMRL_SMT1TMR4_POSN                   equ 0004h
SMT1TMRL_SMT1TMR4_POSITION               equ 0004h
SMT1TMRL_SMT1TMR4_SIZE                   equ 0001h
SMT1TMRL_SMT1TMR4_LENGTH                 equ 0001h
SMT1TMRL_SMT1TMR4_MASK                   equ 0010h
SMT1TMRL_SMT1TMR5_POSN                   equ 0005h
SMT1TMRL_SMT1TMR5_POSITION               equ 0005h
SMT1TMRL_SMT1TMR5_SIZE                   equ 0001h
SMT1TMRL_SMT1TMR5_LENGTH                 equ 0001h
SMT1TMRL_SMT1TMR5_MASK                   equ 0020h
SMT1TMRL_SMT1TMR6_POSN                   equ 0006h
SMT1TMRL_SMT1TMR6_POSITION               equ 0006h
SMT1TMRL_SMT1TMR6_SIZE                   equ 0001h
SMT1TMRL_SMT1TMR6_LENGTH                 equ 0001h
SMT1TMRL_SMT1TMR6_MASK                   equ 0040h
SMT1TMRL_SMT1TMR7_POSN                   equ 0007h
SMT1TMRL_SMT1TMR7_POSITION               equ 0007h
SMT1TMRL_SMT1TMR7_SIZE                   equ 0001h
SMT1TMRL_SMT1TMR7_LENGTH                 equ 0001h
SMT1TMRL_SMT1TMR7_MASK                   equ 0080h

// Register: SMT1TMRH
#define SMT1TMRH SMT1TMRH
SMT1TMRH                                 equ 0D8Dh
// bitfield definitions
SMT1TMRH_SMT1TMR_POSN                    equ 0000h
SMT1TMRH_SMT1TMR_POSITION                equ 0000h
SMT1TMRH_SMT1TMR_SIZE                    equ 0008h
SMT1TMRH_SMT1TMR_LENGTH                  equ 0008h
SMT1TMRH_SMT1TMR_MASK                    equ 00FFh
SMT1TMRH_SMT1TMR8_POSN                   equ 0000h
SMT1TMRH_SMT1TMR8_POSITION               equ 0000h
SMT1TMRH_SMT1TMR8_SIZE                   equ 0001h
SMT1TMRH_SMT1TMR8_LENGTH                 equ 0001h
SMT1TMRH_SMT1TMR8_MASK                   equ 0001h
SMT1TMRH_SMT1TMR9_POSN                   equ 0001h
SMT1TMRH_SMT1TMR9_POSITION               equ 0001h
SMT1TMRH_SMT1TMR9_SIZE                   equ 0001h
SMT1TMRH_SMT1TMR9_LENGTH                 equ 0001h
SMT1TMRH_SMT1TMR9_MASK                   equ 0002h
SMT1TMRH_SMT1TMR10_POSN                  equ 0002h
SMT1TMRH_SMT1TMR10_POSITION              equ 0002h
SMT1TMRH_SMT1TMR10_SIZE                  equ 0001h
SMT1TMRH_SMT1TMR10_LENGTH                equ 0001h
SMT1TMRH_SMT1TMR10_MASK                  equ 0004h
SMT1TMRH_SMT1TMR11_POSN                  equ 0003h
SMT1TMRH_SMT1TMR11_POSITION              equ 0003h
SMT1TMRH_SMT1TMR11_SIZE                  equ 0001h
SMT1TMRH_SMT1TMR11_LENGTH                equ 0001h
SMT1TMRH_SMT1TMR11_MASK                  equ 0008h
SMT1TMRH_SMT1TMR12_POSN                  equ 0004h
SMT1TMRH_SMT1TMR12_POSITION              equ 0004h
SMT1TMRH_SMT1TMR12_SIZE                  equ 0001h
SMT1TMRH_SMT1TMR12_LENGTH                equ 0001h
SMT1TMRH_SMT1TMR12_MASK                  equ 0010h
SMT1TMRH_SMT1TMR13_POSN                  equ 0005h
SMT1TMRH_SMT1TMR13_POSITION              equ 0005h
SMT1TMRH_SMT1TMR13_SIZE                  equ 0001h
SMT1TMRH_SMT1TMR13_LENGTH                equ 0001h
SMT1TMRH_SMT1TMR13_MASK                  equ 0020h
SMT1TMRH_SMT1TMR14_POSN                  equ 0006h
SMT1TMRH_SMT1TMR14_POSITION              equ 0006h
SMT1TMRH_SMT1TMR14_SIZE                  equ 0001h
SMT1TMRH_SMT1TMR14_LENGTH                equ 0001h
SMT1TMRH_SMT1TMR14_MASK                  equ 0040h
SMT1TMRH_SMT1TMR15_POSN                  equ 0007h
SMT1TMRH_SMT1TMR15_POSITION              equ 0007h
SMT1TMRH_SMT1TMR15_SIZE                  equ 0001h
SMT1TMRH_SMT1TMR15_LENGTH                equ 0001h
SMT1TMRH_SMT1TMR15_MASK                  equ 0080h

