GopalSaraf/Practicals/PSDL/include/proc/pic16f1614.inc
// Register: TOSL
#define TOSL TOSL
TOSL                                     equ 0FEEh
// bitfield definitions
TOSL_TOSL_POSN                           equ 0000h
TOSL_TOSL_POSITION                       equ 0000h
TOSL_TOSL_SIZE                           equ 0008h
TOSL_TOSL_LENGTH                         equ 0008h
TOSL_TOSL_MASK                           equ 00FFh

// Register: TOSH
#define TOSH TOSH
TOSH                                     equ 0FEFh
// bitfield definitions
TOSH_TOSH_POSN                           equ 0000h
TOSH_TOSH_POSITION                       equ 0000h
TOSH_TOSH_SIZE                           equ 0007h
TOSH_TOSH_LENGTH                         equ 0007h
TOSH_TOSH_MASK                           equ 007Fh

/*
 * Bit Access Macros
 */

#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr) and 07FFh)
#endif
#ifndef BANKMASK
#define BANKMASK(addr) ((addr) and 07Fh)
#endif
#define ABDEN                            BANKMASK(BAUD1CON), 0
#define ABDOVF                           BANKMASK(BAUD1CON), 7
#define ACC16                            BANKMASK(PID1ACCHL), 0
#define ACC17                            BANKMASK(PID1ACCHL), 1
#define ACC18                            BANKMASK(PID1ACCHL), 2
#define ACC19                            BANKMASK(PID1ACCHL), 3
#define ACC20                            BANKMASK(PID1ACCHL), 4
#define ACC21                            BANKMASK(PID1ACCHL), 5
#define ACC22                            BANKMASK(PID1ACCHL), 6
#define ACC23                            BANKMASK(PID1ACCHL), 7
#define ACC24                            BANKMASK(PID1ACCHH), 0
#define ACC25                            BANKMASK(PID1ACCHH), 1
#define ACC26                            BANKMASK(PID1ACCHH), 2
#define ACC27                            BANKMASK(PID1ACCHH), 3
#define ACC28                            BANKMASK(PID1ACCHH), 4
#define ACC29                            BANKMASK(PID1ACCHH), 5
#define ACC30                            BANKMASK(PID1ACCHH), 6
#define ACC31                            BANKMASK(PID1ACCHH), 7
#define ACC32                            BANKMASK(PID1ACCU), 0
#define ACC33                            BANKMASK(PID1ACCU), 1
#define ACC34                            BANKMASK(PID1ACCU), 2
#define ACCM                             BANKMASK(CRCCON0), 4
#define ACCS                             BANKMASK(AT1CON1), 1
#define ACKDT                            BANKMASK(SSP1CON2), 5
#define ACKEN                            BANKMASK(SSP1CON2), 4
#define ACKSTAT                          BANKMASK(SSP1CON2), 6
#define ACKTIM                           BANKMASK(SSP1CON3), 7
#define ADCS0                            BANKMASK(ADCON1), 4
#define ADCS1                            BANKMASK(ADCON1), 5
#define ADCS2                            BANKMASK(ADCON1), 6
#define ADD0                             BANKMASK(SSP1ADD), 0
#define ADD1                             BANKMASK(SSP1ADD), 1
#define ADD2                             BANKMASK(SSP1ADD), 2
#define ADD3                             BANKMASK(SSP1ADD), 3
#define ADD4                             BANKMASK(SSP1ADD), 4
#define ADD5                             BANKMASK(SSP1ADD), 5
#define ADD6                             BANKMASK(SSP1ADD), 6
#define ADD7                             BANKMASK(SSP1ADD), 7
#define ADDEN                            BANKMASK(RC1STA), 3
#define ADFM                             BANKMASK(ADCON1), 7
#define ADFVR0                           BANKMASK(FVRCON), 0
#define ADFVR1                           BANKMASK(FVRCON), 1
#define ADGO                             BANKMASK(ADCON0), 1
#define ADIE                             BANKMASK(PIE1), 6
#define ADIF                             BANKMASK(PIR1), 6
#define ADON                             BANKMASK(ADCON0), 0
#define ADPREF0                          BANKMASK(ADCON1), 0
#define ADPREF1                          BANKMASK(ADCON1), 1
#define AHEN                             BANKMASK(SSP1CON3), 1
#define ANSA0                            BANKMASK(ANSELA), 0
#define ANSA1                            BANKMASK(ANSELA), 1
#define ANSA2                            BANKMASK(ANSELA), 2
#define ANSA4                            BANKMASK(ANSELA), 4
#define ANSC0                            BANKMASK(ANSELC), 0
#define ANSC1                            BANKMASK(ANSELC), 1
#define ANSC2                            BANKMASK(ANSELC), 2
#define ANSC3                            BANKMASK(ANSELC), 3
#define APMOD                            BANKMASK(AT1CON0), 1
#define AT1ACCS                          BANKMASK(AT1CON1), 1
#define AT1APMOD                         BANKMASK(AT1CON0), 1
#define AT1CAP1P                         BANKMASK(AT1CCON1), 3
#define AT1CAP2P                         BANKMASK(AT1CCON2), 3
#define AT1CAP3P                         BANKMASK(AT1CCON3), 3
#define AT1CC10                          BANKMASK(AT1CC1L), 0
#define AT1CC11                          BANKMASK(AT1CC1L), 1
#define AT1CC12                          BANKMASK(AT1CC1L), 2
#define AT1CC13                          BANKMASK(AT1CC1L), 3
#define AT1CC14                          BANKMASK(AT1CC1L), 4
#define AT1CC15                          BANKMASK(AT1CC1L), 5
#define AT1CC16                          BANKMASK(AT1CC1L), 6
#define AT1CC17                          BANKMASK(AT1CC1L), 7
#define AT1CC18                          BANKMASK(AT1CC1H), 0
#define AT1CC19                          BANKMASK(AT1CC1H), 1
#define AT1CC1EN                         BANKMASK(AT1CCON1), 7
#define AT1CC1IE                         BANKMASK(AT1IE1), 0
#define AT1CC1IF                         BANKMASK(AT1IR1), 0
#define AT1CC1MODE                       BANKMASK(AT1CCON1), 0
#define AT1CC1POL                        BANKMASK(AT1CCON1), 4
#define AT1CC20                          BANKMASK(AT1CC2L), 0
#define AT1CC21                          BANKMASK(AT1CC2L), 1
#define AT1CC22                          BANKMASK(AT1CC2L), 2
#define AT1CC23                          BANKMASK(AT1CC2L), 3
#define AT1CC24                          BANKMASK(AT1CC2L), 4
#define AT1CC25                          BANKMASK(AT1CC2L), 5
#define AT1CC26                          BANKMASK(AT1CC2L), 6
#define AT1CC27                          BANKMASK(AT1CC2L), 7
#define AT1CC28                          BANKMASK(AT1CC2H), 0
#define AT1CC29                          BANKMASK(AT1CC2H), 1
#define AT1CC2EN                         BANKMASK(AT1CCON2), 7
#define AT1CC2IE                         BANKMASK(AT1IE1), 1
#define AT1CC2IF                         BANKMASK(AT1IR1), 1
#define AT1CC2MODE                       BANKMASK(AT1CCON2), 0
#define AT1CC2POL                        BANKMASK(AT1CCON2), 4
#define AT1CC30                          BANKMASK(AT1CC3L), 0
#define AT1CC31                          BANKMASK(AT1CC3L), 1
#define AT1CC32                          BANKMASK(AT1CC3L), 2
#define AT1CC33                          BANKMASK(AT1CC3L), 3
#define AT1CC34                          BANKMASK(AT1CC3L), 4
#define AT1CC35                          BANKMASK(AT1CC3L), 5
#define AT1CC36                          BANKMASK(AT1CC3L), 6
#define AT1CC37                          BANKMASK(AT1CC3L), 7
#define AT1CC38                          BANKMASK(AT1CC3H), 0
#define AT1CC39                          BANKMASK(AT1CC3H), 1
#define AT1CC3EN                         BANKMASK(AT1CCON3), 7
#define AT1CC3IE                         BANKMASK(AT1IE1), 2
#define AT1CC3IF                         BANKMASK(AT1IR1), 2
#define AT1CC3MODE                       BANKMASK(AT1CCON3), 0
#define AT1CC3POL                        BANKMASK(AT1CCON3), 4
#define AT1CP1S0                         BANKMASK(AT1CSEL1), 0
#define AT1CP1S1                         BANKMASK(AT1CSEL1), 1
#define AT1CP1S2                         BANKMASK(AT1CSEL1), 2
#define AT1CP2S0                         BANKMASK(AT1CSEL2), 0
#define AT1CP2S1                         BANKMASK(AT1CSEL2), 1
#define AT1CP2S2                         BANKMASK(AT1CSEL2), 2
#define AT1CP3S0                         BANKMASK(AT1CSEL3), 0
#define AT1CP3S1                         BANKMASK(AT1CSEL3), 1
#define AT1CP3S2                         BANKMASK(AT1CSEL3), 2
#define AT1CS                            BANKMASK(AT1CLK), 0
#define AT1CS0                           BANKMASK(AT1CLK), 0
#define AT1EN                            BANKMASK(AT1CON0), 7
#define AT1ERR0                          BANKMASK(AT1ERRL), 0
#define AT1ERR1                          BANKMASK(AT1ERRL), 1
#define AT1ERR10                         BANKMASK(AT1ERRH), 2
#define AT1ERR11                         BANKMASK(AT1ERRH), 3
#define AT1ERR12                         BANKMASK(AT1ERRH), 4
#define AT1ERR13                         BANKMASK(AT1ERRH), 5
#define AT1ERR14                         BANKMASK(AT1ERRH), 6
#define AT1ERR15                         BANKMASK(AT1ERRH), 7
#define AT1ERR2                          BANKMASK(AT1ERRL), 2
#define AT1ERR3                          BANKMASK(AT1ERRL), 3
#define AT1ERR4                          BANKMASK(AT1ERRL), 4
#define AT1ERR5                          BANKMASK(AT1ERRL), 5
#define AT1ERR6                          BANKMASK(AT1ERRL), 6
#define AT1ERR7                          BANKMASK(AT1ERRL), 7
#define AT1ERR8                          BANKMASK(AT1ERRH), 0
#define AT1ERR9                          BANKMASK(AT1ERRH), 1
#define AT1IE                            BANKMASK(PIE5), 2
#define AT1IF                            BANKMASK(PIR5), 2
#define AT1MISS0                         BANKMASK(AT1MISSL), 0
#define AT1MISS1                         BANKMASK(AT1MISSL), 1
#define AT1MISS10                        BANKMASK(AT1MISSH), 2
#define AT1MISS11                        BANKMASK(AT1MISSH), 3
#define AT1MISS12                        BANKMASK(AT1MISSH), 4
#define AT1MISS13                        BANKMASK(AT1MISSH), 5
#define AT1MISS14                        BANKMASK(AT1MISSH), 6
#define AT1MISS15                        BANKMASK(AT1MISSH), 7
#define AT1MISS2                         BANKMASK(AT1MISSL), 2
#define AT1MISS3                         BANKMASK(AT1MISSL), 3
#define AT1MISS4                         BANKMASK(AT1MISSL), 4
#define AT1MISS5                         BANKMASK(AT1MISSL), 5
#define AT1MISS6                         BANKMASK(AT1MISSL), 6
#define AT1MISS7                         BANKMASK(AT1MISSL), 7
#define AT1MISS8                         BANKMASK(AT1MISSH), 0
#define AT1MISS9                         BANKMASK(AT1MISSH), 1
#define AT1MISSIE                        BANKMASK(AT1IE0), 1
#define AT1MISSIF                        BANKMASK(AT1IR0), 1
#define AT1MODE                          BANKMASK(AT1CON0), 0
#define AT1MPP                           BANKMASK(AT1CON1), 2
#define AT1PER0                          BANKMASK(AT1PERL), 0
#define AT1PER1                          BANKMASK(AT1PERL), 1
#define AT1PER10                         BANKMASK(AT1PERH), 2
#define AT1PER11                         BANKMASK(AT1PERH), 3
#define AT1PER12                         BANKMASK(AT1PERH), 4
#define AT1PER13                         BANKMASK(AT1PERH), 5
#define AT1PER14                         BANKMASK(AT1PERH), 6
#define AT1PER2                          BANKMASK(AT1PERL), 2
#define AT1PER3                          BANKMASK(AT1PERL), 3
#define AT1PER4                          BANKMASK(AT1PERL), 4
#define AT1PER5                          BANKMASK(AT1PERL), 5
#define AT1PER6                          BANKMASK(AT1PERL), 6
#define AT1PER7                          BANKMASK(AT1PERL), 7
#define AT1PER8                          BANKMASK(AT1PERH), 0
#define AT1PER9                          BANKMASK(AT1PERH), 1
#define AT1PERIE                         BANKMASK(AT1IE0), 0
#define AT1PERIF                         BANKMASK(AT1IR0), 0
#define AT1PHP                           BANKMASK(AT1CON1), 6
#define AT1PHS0                          BANKMASK(AT1PHSL), 0
#define AT1PHS1                          BANKMASK(AT1PHSL), 1
#define AT1PHS2                          BANKMASK(AT1PHSL), 2
#define AT1PHS3                          BANKMASK(AT1PHSL), 3
#define AT1PHS4                          BANKMASK(AT1PHSL), 4
#define AT1PHS5                          BANKMASK(AT1PHSL), 5
#define AT1PHS6                          BANKMASK(AT1PHSL), 6
#define AT1PHS7                          BANKMASK(AT1PHSL), 7
#define AT1PHS8                          BANKMASK(AT1PHSH), 0
#define AT1PHS9                          BANKMASK(AT1PHSH), 1
#define AT1PHSIE                         BANKMASK(AT1IE0), 2
#define AT1PHSIF                         BANKMASK(AT1IR0), 2
#define AT1POL                           BANKMASK(AT1CON0), 3
#define AT1POV                           BANKMASK(AT1PERH), 7
#define AT1PREC                          BANKMASK(AT1CON0), 6
#define AT1PRP                           BANKMASK(AT1CON1), 4
#define AT1PS0                           BANKMASK(AT1CON0), 4
#define AT1PS1                           BANKMASK(AT1CON0), 5
#define AT1RES0                          BANKMASK(AT1RESL), 0
#define AT1RES1                          BANKMASK(AT1RESL), 1
#define AT1RES2                          BANKMASK(AT1RESL), 2
#define AT1RES3                          BANKMASK(AT1RESL), 3
#define AT1RES4                          BANKMASK(AT1RESL), 4
#define AT1RES5                          BANKMASK(AT1RESL), 5
#define AT1RES6                          BANKMASK(AT1RESL), 6
#define AT1RES7                          BANKMASK(AT1RESL), 7
#define AT1RES8                          BANKMASK(AT1RESH), 0
#define AT1RES9                          BANKMASK(AT1RESH), 1
#define AT1SSEL0                         BANKMASK(AT1SIG), 0
#define AT1SSEL1                         BANKMASK(AT1SIG), 1
#define AT1SSEL2                         BANKMASK(AT1SIG), 2
#define AT1STPT0                         BANKMASK(AT1STPTL), 0
#define AT1STPT1                         BANKMASK(AT1STPTL), 1
#define AT1STPT10                        BANKMASK(AT1STPTH), 2
#define AT1STPT11                        BANKMASK(AT1STPTH), 3
#define AT1STPT12                        BANKMASK(AT1STPTH), 4
#define AT1STPT13                        BANKMASK(AT1STPTH), 5
#define AT1STPT14                        BANKMASK(AT1STPTH), 6
#define AT1STPT2                         BANKMASK(AT1STPTL), 2
#define AT1STPT3                         BANKMASK(AT1STPTL), 3
#define AT1STPT4                         BANKMASK(AT1STPTL), 4
#define AT1STPT5                         BANKMASK(AT1STPTL), 5
#define AT1STPT6                         BANKMASK(AT1STPTL), 6
#define AT1STPT7                         BANKMASK(AT1STPTL), 7
#define AT1STPT8                         BANKMASK(AT1STPTH), 0
#define AT1STPT9                         BANKMASK(AT1STPTH), 1
#define AT1VALID                         BANKMASK(AT1CON1), 0
#define ATCC1PPS0                        BANKMASK(ATCC1PPS), 0
#define ATCC1PPS1                        BANKMASK(ATCC1PPS), 1
#define ATCC1PPS2                        BANKMASK(ATCC1PPS), 2
#define ATCC1PPS3                        BANKMASK(ATCC1PPS), 3
#define ATCC1PPS4                        BANKMASK(ATCC1PPS), 4
#define ATCC2PPS0                        BANKMASK(ATCC2PPS), 0
#define ATCC2PPS1                        BANKMASK(ATCC2PPS), 1
#define ATCC2PPS2                        BANKMASK(ATCC2PPS), 2
#define ATCC2PPS3                        BANKMASK(ATCC2PPS), 3
#define ATCC2PPS4                        BANKMASK(ATCC2PPS), 4
#define ATCC3PPS0                        BANKMASK(ATCC3PPS), 0
#define ATCC3PPS1                        BANKMASK(ATCC3PPS), 1
#define ATCC3PPS2                        BANKMASK(ATCC3PPS), 2
#define ATCC3PPS3                        BANKMASK(ATCC3PPS), 3
#define ATCC3PPS4                        BANKMASK(ATCC3PPS), 4
#define ATINPPS0                         BANKMASK(ATINPPS), 0
#define ATINPPS1                         BANKMASK(ATINPPS), 1
#define ATINPPS2                         BANKMASK(ATINPPS), 2
#define ATINPPS3                         BANKMASK(ATINPPS), 3
#define ATINPPS4                         BANKMASK(ATINPPS), 4
#define BCL1IE                           BANKMASK(PIE2), 3
#define BCL1IF                           BANKMASK(PIR2), 3
#define BF                               BANKMASK(SSP1STAT), 0
#define BOEN                             BANKMASK(SSP1CON3), 4
#define BORFS                            BANKMASK(BORCON), 6
#define BORRDY                           BANKMASK(BORCON), 0
#define BRG16                            BANKMASK(BAUD1CON), 3
#define BRGH                             BANKMASK(TX1STA), 2
#define BSR0                             BANKMASK(BSR), 0
#define BSR1                             BANKMASK(BSR), 1
#define BSR2                             BANKMASK(BSR), 2
#define BSR3                             BANKMASK(BSR), 3
#define BSR4                             BANKMASK(BSR), 4
#define BUF0                             BANKMASK(SSP1BUF), 0
#define BUF1                             BANKMASK(SSP1BUF), 1
#define BUF2                             BANKMASK(SSP1BUF), 2
#define BUF3                             BANKMASK(SSP1BUF), 3
#define BUF4                             BANKMASK(SSP1BUF), 4
#define BUF5                             BANKMASK(SSP1BUF), 5
#define BUF6                             BANKMASK(SSP1BUF), 6
#define BUF7                             BANKMASK(SSP1BUF), 7
#define C1AS                             BANKMASK(CWG1AS1), 1
#define C1HYS                            BANKMASK(CM1CON0), 1
#define C1IE                             BANKMASK(PIE2), 5
#define C1IF                             BANKMASK(PIR2), 5
#define C1INTN                           BANKMASK(CM1CON1), 6
#define C1INTP                           BANKMASK(CM1CON1), 7
#define C1NCH0                           BANKMASK(CM1CON1), 0
#define C1NCH1                           BANKMASK(CM1CON1), 1
#define C1NCH2                           BANKMASK(CM1CON1), 2
#define C1ON                             BANKMASK(CM1CON0), 7
#define C1OUT                            BANKMASK(CM1CON0), 6
#define C1PCH0                           BANKMASK(CM1CON1), 4
#define C1PCH1                           BANKMASK(CM1CON1), 5
#define C1POL                            BANKMASK(CM1CON0), 4
#define C1SP                             BANKMASK(CM1CON0), 2
#define C1SYNC                           BANKMASK(CM1CON0), 0
#define C2AS                             BANKMASK(CWG1AS1), 2
#define C2HYS                            BANKMASK(CM2CON0), 1
#define C2IE                             BANKMASK(PIE2), 6
#define C2IF                             BANKMASK(PIR2), 6
#define C2INTN                           BANKMASK(CM2CON1), 6
#define C2INTP                           BANKMASK(CM2CON1), 7
#define C2NCH0                           BANKMASK(CM2CON1), 0
#define C2NCH1                           BANKMASK(CM2CON1), 1
#define C2NCH2                           BANKMASK(CM2CON1), 2
#define C2ON                             BANKMASK(CM2CON0), 7
#define C2OUT                            BANKMASK(CM2CON0), 6
#define C2PCH0                           BANKMASK(CM2CON1), 4
#define C2PCH1                           BANKMASK(CM2CON1), 5
#define C2POL                            BANKMASK(CM2CON0), 4
#define C2SP                             BANKMASK(CM2CON0), 2
#define C2SYNC                           BANKMASK(CM2CON0), 0
#define CAP1P                            BANKMASK(AT1CCON1), 3
#define CAP2P                            BANKMASK(AT1CCON2), 3
#define CAP3P                            BANKMASK(AT1CCON3), 3
#define CARRY                            BANKMASK(STATUS), 0
#define CC10                             BANKMASK(AT1CC1L), 0
#define CC11                             BANKMASK(AT1CC1L), 1
#define CC12                             BANKMASK(AT1CC1L), 2
#define CC14                             BANKMASK(AT1CC1L), 4
#define CC15                             BANKMASK(AT1CC1L), 5
#define CC16                             BANKMASK(AT1CC1L), 6
#define CC17                             BANKMASK(AT1CC1L), 7
#define CC18                             BANKMASK(AT1CC1H), 0
#define CC19                             BANKMASK(AT1CC1H), 1
#define CC1EN                            BANKMASK(AT1CCON1), 7
#define CC1MODE                          BANKMASK(AT1CCON1), 0
#define CC1POL                           BANKMASK(AT1CCON1), 4
#define CC20                             BANKMASK(AT1CC2L), 0
#define CC21                             BANKMASK(AT1CC2L), 1
#define CC22                             BANKMASK(AT1CC2L), 2
#define CC24                             BANKMASK(AT1CC2L), 4
#define CC26                             BANKMASK(AT1CC2L), 6
#define CC27                             BANKMASK(AT1CC2L), 7
#define CC28                             BANKMASK(AT1CC2H), 0
#define CC29                             BANKMASK(AT1CC2H), 1
#define CC2EN                            BANKMASK(AT1CCON2), 7
#define CC2MODE                          BANKMASK(AT1CCON2), 0
#define CC2POL                           BANKMASK(AT1CCON2), 4
#define CC30                             BANKMASK(AT1CC3L), 0
#define CC31                             BANKMASK(AT1CC3L), 1
#define CC32                             BANKMASK(AT1CC3L), 2
#define CC33                             BANKMASK(AT1CC3L), 3
#define CC34                             BANKMASK(AT1CC3L), 4
#define CC35                             BANKMASK(AT1CC3L), 5
#define CC36                             BANKMASK(AT1CC3L), 6
#define CC37                             BANKMASK(AT1CC3L), 7
#define CC38                             BANKMASK(AT1CC3H), 0
#define CC39                             BANKMASK(AT1CC3H), 1
#define CC3EN                            BANKMASK(AT1CCON3), 7
#define CC3MODE                          BANKMASK(AT1CCON3), 0
#define CC3POL                           BANKMASK(AT1CCON3), 4
#define CCP1CTS0                         BANKMASK(CCP1CAP), 0
#define CCP1CTS1                         BANKMASK(CCP1CAP), 1
#define CCP1CTS2                         BANKMASK(CCP1CAP), 2
#define CCP1EN                           BANKMASK(CCP1CON), 7
#define CCP1FMT                          BANKMASK(CCP1CON), 4
#define CCP1IE                           BANKMASK(PIE1), 2
#define CCP1IF                           BANKMASK(PIR1), 2
#define CCP1MODE0                        BANKMASK(CCP1CON), 0
#define CCP1MODE1                        BANKMASK(CCP1CON), 1
#define CCP1MODE2                        BANKMASK(CCP1CON), 2
#define CCP1MODE3                        BANKMASK(CCP1CON), 3
#define CCP1OUT                          BANKMASK(CCP1CON), 5
#define CCP1PPS0                         BANKMASK(CCP1PPS), 0
#define CCP1PPS1                         BANKMASK(CCP1PPS), 1
#define CCP1PPS2                         BANKMASK(CCP1PPS), 2
#define CCP1PPS3                         BANKMASK(CCP1PPS), 3
#define CCP1PPS4                         BANKMASK(CCP1PPS), 4
#define CCP1TSEL0                        BANKMASK(CCPTMRS), 0
#define CCP1TSEL1                        BANKMASK(CCPTMRS), 1
#define CCP2CTS0                         BANKMASK(CCP2CAP), 0
#define CCP2CTS1                         BANKMASK(CCP2CAP), 1
#define CCP2CTS2                         BANKMASK(CCP2CAP), 2
#define CCP2EN                           BANKMASK(CCP2CON), 7
#define CCP2FMT                          BANKMASK(CCP2CON), 4
#define CCP2IE                           BANKMASK(PIE2), 0
#define CCP2IF                           BANKMASK(PIR2), 0
#define CCP2MODE0                        BANKMASK(CCP2CON), 0
#define CCP2MODE1                        BANKMASK(CCP2CON), 1
#define CCP2MODE2                        BANKMASK(CCP2CON), 2
#define CCP2MODE3                        BANKMASK(CCP2CON), 3
#define CCP2OUT                          BANKMASK(CCP2CON), 5
#define CCP2PPS0                         BANKMASK(CCP2PPS), 0
#define CCP2PPS1                         BANKMASK(CCP2PPS), 1
#define CCP2PPS2                         BANKMASK(CCP2PPS), 2
#define CCP2PPS3                         BANKMASK(CCP2PPS), 3
#define CCP2PPS4                         BANKMASK(CCP2PPS), 4
